api/modules/v1/models/Consultant.php

SELECT SUM(rate) FROM `vizr_rating` WHERE `consultant_id`=1
---
    public function getRatingsum()
    {
        return $this->hasMany(Rating::className(), ['consultant_id' => 'id'])->sum('rate');